<template>
  <div class="modal" v-if="isVisible">
    <div class="modal-content">
      <span class="close" @click="closeModal">&times;</span>
      <h2>Star Road 서비스 이용 약관</h2>
      <div class="modal-body">
        <p>
          starroad 이용정책은 starroad 이용 약관에 동의하고 회원 가입한 starroad
          회원(이하 '회원')이 starroad 서비스를 이용함에 있어 유의사항과 관련
          법령 또는 starroad 이용 약관에 반하는 부적절한 활동에 대한
          starroad(이하 '회사')의 조치를 규정하는 것을 목적으로 합니다. starroad
          서비스에 관한 제반 사항은 본 starroad 서비스 이용정책에서 별도의
          언급이 없는 한 starroad 이용약관을 따르며, starroad 서비스에 게시되는
          리뷰 내용에 관한 유의사항 및 이용 제한에 관한 사항은 starroad 리뷰
          이용정책을 따릅니다. starroad 이용정책 변경 시에는 starroad 공식
          블로그와 starroad 서비스 초기 화면의 링크를 통해 사전에 공지합니다.
        </p>
        <br />
        <p>
          1. starroad 이용 안내<br />
          가. starroad는 다음과 같은 서비스를 제공합니다.<br />
          1) 방문 내역 기록: ‘회원’이 starroad 등록 업체 또는 starroad 예약,
          주문 서비스 업체를 직접 방문 및 이용한 사실을 회사가 제공하는 방법으로
          인증하여 방문 내역을 기록할 수 있습니다.<br />
          2) 리뷰, 사업주 답글: ‘회원’은 starroad 예약 또는 주문 이용 내역 또는
          방문 인증한 내역을 기반으로 리뷰를 작성할 수 있고, 리뷰는 검색 결과
          또는 피드, starroad 메인 등 각 starroad 서비스에 게시될 수 있습니다.
          그와 같이 게시된 리뷰에 대해서는 해당 starroad의 사업주가 답글을 남길
          수도 있습니다.<br />
          3) 프로필: ‘회원’은 starroad 전용 프로필 기능으로 자신을 소개하는
          프로필 이미지, 닉네임, 소개글을 설정할 수 있습니다.<br />
          4) 리뷰 리액션: ‘회원’은 다른 회원의 리뷰를 조회한 뒤 해당 리뷰에
          리액션 버튼을 통해 반응을 남길 수 있습니다.<br />
          5) 다른 ‘회원’ 팔로우 및 피드 : ‘회원’은 다른 ‘회원’을 팔로우 할 수
          있고, 피드를 통해 자신이 팔로우 한 다른 ‘회원’이 작성한 리뷰를 확인할
          수 있습니다.
        </p>
        <br />
        <p>
          나. starroad 서비스(이하 '서비스') 중 방문 및 이용 사실 인증 및 리뷰
          작성은 실명 확인이 완료된 starroad 계정으로만 이용 가능합니다. 회사는
          회원이 업체를 직접 방문 또는 이용한 사실을 여러 수단으로 인증할 수
          있도록 새로운 인증 방법을 제공하고 그에 맞는 이용 동의를 요청할 수
          있습니다. 영수증 리뷰는 starroad 이용약관 및 ‘영수증 수집 및 이용
          동의’에 대한 최초 1회 동의가 필요합니다.
        </p>
        <br />
        <p>
          다. 회원은 동일한 장소의 리뷰를 하루에 한 번만 작성할 수 있습니다.
          회원이 작성한 starroad 리뷰는 ’회사’의 내부적인 기준에 따라 해당 매장
          방문 또는 이용 인증에 문제 없음이 인정되는 등 높은 수준의 신뢰도가
          확인된 리뷰만 게시 및 노출될 수 있습니다.
        </p>
        <br />
        <p>
          2. starroad 이벤트, 프로모션 정책<br />
          회사는 이벤트 또는 프로모션을 통해 회원에게 보상을 제공할 수 있습니다.
          이벤트 또는 프로모션 기준에 따른 보상은 starroad 실명 확인 계정 중 1개
          계정으로만 지급받을 수 있습니다. 이벤트, 프로모션에 대한 설명과 당첨자
          선정 기준은 각 이벤트 페이지에 게시됩니다.
        </p>
        <br />
        <p>
          3. 회원의 금지행위<br />
          회사는 서비스의 신뢰성을 제고하기 위하여 회원의 서비스 이용 시 아래와
          같은 행위를 금지합니다.<br />
          가. 회사가 제공하는 서비스 이용방법에 의하지 아니하고 비정상적인
          방법으로 서비스를 이용하거나 시스템에 접근하는 행위<br />
          나. 타인의 명의를 도용하여 회사가 제공하는 서비스를 이용하는 행위<br />
          다. 회사가 게시한 정보의 무단 변경 또는 회사가 정한 정보 이외의
          정보(컴퓨터 프로그램 등) 등의 송신 또는 게시 행위<br />
          라. 영수증 제출기준에 맞지 않는 영수증을 제출하여 방문 인증 후 리뷰를
          작성하는 행위
        </p>
        <br />
        <p>
          1) 필수정보가 없는 영수증으로 반복적으로 인증하는 행위 (업체명,
          업체주소, 업체 전화번호 또는 사업자등록번호, 결제일시, 결제승인번호,
          결제금액)<br />
          2) 장소가 아닌 곳 (인터넷 쇼핑몰, 택배, 관리비 영수증, 택시 등)을
          반복적으로 방문 인증하는 행위<br />
          3) 제출 대상이 아닌 영수증 (수기 영수증 등)으로 반복 인증하는 행위<br />
          4) 업체 방문 경험이 종료된 전체 환불 또는 일부 환불된 영수증으로
          인증하는 행위
        </p>
        <br />
        <p>
          마. 방문 또는 이용 사실을 거짓 “인증”, 허위 또는 표시광고법을 위반한
          대가성 리뷰 작성하거나 리뷰를 매수하는 행위, 다른 회원의 불편을 초래할
          수 있는 프로필 설정, 과도한 반응 남기기 또는 팔로우 요청 행위 등으로,
          이하 각 호를 포함함.
        </p>
        <br />
        <p>
          1) 동일한 영수증을 지속적, 반복적으로 제출하는 행위<br />
          2) 직접 촬영하지 않은 영수증을 메신저 또는 다른 매체로 (ex. 클라우드
          서비스, 기기간 전송 등) 전달받아서 제출하거나 파일을 다운받아서
          제출하는 행위<br />
          3) 동일인이 수 개 네이버 계정을 이용하여 서비스를 이용하는 행위<br />
          4) 회원이 직접 방문하지 않은 장소의 영수증을 제출하여 방문 사실을 거짓
          인증하는 행위 또는 거짓 인증하는 행위에 대해 대가를 지불받고 리뷰를
          작성하는 행위<br />
          5) 결제 정보와 일치하지 않는 업체를 매칭하여 지속적으로 방문 사실을
          거짓 인증하는 행위<br />
          6) 영수증이 아닌 것(이미지, 문자나 계좌 캡처사진 등)을 제출하여 방문
          사실을 거짓 인증하는 행위<br />
          7) 훼손된 영수증 또는 조작된 영수증으로 인증하는 행위<br />
          8) 부정거래(허위거래)를 발생시켜 인증하는 경우 (‘허위거래’란 신용카드
          현금융통, 리뷰 조작, "회사" 제공 이벤트 쿠폰·적립금 편취를 목적으로
          하는 거래, 사업주/이용자가 노출 순위, 리뷰 등을 조작하기 위해 사전에
          부당하게 협의한 거래 등 모든 부정거래행위를 말합니다.)<br />
          9) 직원, 가족 등 지인간에 부당한 목적 및 방법으로 방문 또는 이용
          사실을 인증하는 경우<br />
          10) 기타 회사가 정하지 않은 방식으로 시스템에 접근하여 이용 사실을
          인증하는 경우<br />
          11) 혐오 표현이나 부적절한 내용 등으로의 프로필 설정, 무분별한 반응
          남기기 또는 팔로우 요청 등으로 다른 회원에게 불편 또는 불쾌함을 유발할
          수 있는 행위<br />
          바. 플레이스 리뷰 이용정책을 위반하는 행위<br />
          사. 기타 불법적이거나 서비스 목적에 반하는 부당한 행위
        </p>
        <br />
        <p>
          4. 서비스 이용제한<br />
          회원이 제3항을 위반하여 금지 행위를 하였다고 판단되는 경우 위반 행위
          내용 및 정도 등 서비스의 정상 운영에 영향을 미치는 요소에 따라 회사는
          사전 통보 없이 아래와 같이 회원의 서비스 이용을 제한할 수 있습니다.<br />
          가. 금지 행위를 하였다고 판단되는 계정의 starroad 활동 내역 (리뷰,
          반응, 팔로우, 등록한 프로필 등)을 전부 혹은 일부를 숨김 처리하거나
          열람을 제한하거나 초기화 할 수 있습니다.<br />
          나. starroad 활동 (영수증 인증 등) 또는 이벤트, 프로모션을 통해 기
          적립된 starroad 포인트의 일부 또는 전부가 회수될 수 있습니다.<br />
          다. 회원의 서비스 이용을 일시적 또는 영구적으로 정지할 수 있고, 서비스
          이용이 정지된 회원의 starroad 활동 내역은 모두 숨김 처리되어 서비스에
          노출되지 않을 수 있습니다.<br />
          라. 서비스의 이용이 영구적으로 정지된 회원은 회원이 소유한 다른
          starroad 실명 계정도 함께 서비스 이용이 영구적으로 제한될 수 있으며,
          해당 계정에 starroad 영수증 인증, 활동 또는 이벤트 등을 통해 기 적립된
          포인트의 전부가 회수될 수 있습니다.<br />
          회사가 starroad 포인트의 회수, 서비스 이용의 정지를 하는 경우 회원이
          제공한 전자우편주소, (휴대)전화번호, 서비스 내 팝업 등의 방법으로
          통지하며, 회원에게 원칙적으로 3영업일 이상의 기간을 정하여 이의신청의
          기회를 부여합니다. 단, 회원의 관련 법령, 약관, 서비스이용정책 등
          위반행위가 중대하다고 판단될 경우에는 이의신청 기회를 부여하지 않을 수
          있습니다.
        </p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'TermsModal',
  props: {
    isVisible: {
      type: Boolean,
      required: true,
    },
  },
  methods: {
    closeModal() {
      this.$emit('close');
    },
  },
};
</script>

<style scoped>
.modal {
  display: flex;
  justify-content: center;
  align-items: center;
  position: fixed;
  z-index: 1000;
  left: 0;
  top: 0;
  width: 100%;
  height: 100%;
  overflow: auto;
  background-color: rgba(0, 0, 0, 0.5);
}
.modal-content {
  background-color: #fefefe;
  padding: 20px;
  border: 1px solid #888;
  width: 350px; /* 회원가입 폼과 동일한 너비로 설정 */
  max-width: 600px;
  border-radius: 8px;
  position: relative;
}
.close {
  color: #aaa;
  float: right;
  font-size: 28px;
  font-weight: bold;
}
.close:hover,
.close:focus {
  color: black;
  text-decoration: none;
  cursor: pointer;
}
.modal-body {
  max-height: 400px; /* 모달 내용의 최대 높이 설정 */
  overflow-y: auto; /* 내용이 넘칠 경우 스크롤바 표시 */
}
</style>
